from django.db import models
from django.contrib.auth.models import User
  



class Employe(models.Model):
    
    FAC = (('المديرية','المديرية'),('الرياضة','الرياضة'),
           ('كلية الطب','كلية الطب'),('الطبيعة والحياة','الطبيعة والحياة'),
            ('الرياضيات وعلوم المادة','الرياضيات وعلوم المادة'),
            ('معهد التكنولوجيا','معهد التكنولوجيا'),
            ('الإقتصاد','الإقتصاد'),('اللغات','اللغات'),('العلوم الإنسانية','العلوم الإنسانية'),
            ('الحقوق و العلوم السياسية','الحقوق و العلوم السياسية'),
            ('التكنولوجيات الحديثة','التكنولوجيات الحديثة'),
            ('العلوم التطبيقية','العلوم التطبيقية'),('المحروقات','المحروقات'))
    
    
    POSITION = (('في الخدمة','في الخدمة'),
                ('وضع تحت التصرف','وضع تحت التصرف'),
                ('عطلة مرضية طويلة المدة','عطلة مرضية طويلة المدة'),
                ('إنتداب محدد','إنتداب محدد'),
                ('إنتداب غ محدد','إنتداب غ محدد'),
                ('إستيداع شخصي','إستيداع شخصي'),
                ('إستيداع قانوني','إستيداع قانوني'))
 
    GRAD = (
            ('رئيس المهندسين في السكن والعمران','رئيس المهندسين في السكن والعمران'),
            ('مهندس معماري','مهندس معماري'),
            ('سائق سيارة من الصنف 1','سائق سيارة من الصنف 1'),
            ('عامل مهني خارج الصنف','عامل مهني خارج الصنف'),
            ('عامل مهني من الصنف 1','عامل مهني من الصنف 1'),
            ('عامل مهني من الصنف 2','عامل مهني من الصنف 2'),
            ('تقني سامي في الفلاحة','تقني سامي في الفلاحة'),
            ('مهندس رئيسي في الفلاحة','مهندس رئيسي في الفلاحة'),
            ('جراح  أسنان عام للصحة العمومية','جراح  أسنان عام للصحة العمومية'), 
            ('طبيـب عام رئيس  للصحة العمومية','طبيـب عام رئيس  للصحة العمومية'),
            ('طبيـب عام رئيسي للصحة العمومية','طبيـب عام رئيسي للصحة العمومية'),
            ('مساعد تمريض للصحة العمومية','مساعد تمريض للصحة العمومية'),
            ('ممرض متخصص للصحة العمومية','ممرض متخصص للصحة العمومية'),
            ('ممرض ممتاز  للصحة العمومية','ممرض ممتاز  للصحة العمومية'),
            ('مهندس دولة في الإحصائيات','مهندس دولة في الإحصائيات'),
            ('مهندس رئيسي في الإحصائيات','مهندس رئيسي في الإحصائيات'),
            ('عون إدارة','عون إدارة'),
            ('عون ادارة رئيسي','عون ادارة رئيسي'),
            ('عون حفظ البيانات','عون حفظ البيانات'),
            ('عون مكتب','عون مكتب'),
            ('كاتبة','كاتبة'),
            ('كاتبة مديرية','كاتبة مديرية'),
            ('كاتبة مديرية رئيسية','كاتبة مديرية رئيسية'),
            ('مترجم  ترجمان متخصص','مترجم  ترجمان متخصص'),
            ('متصرف','متصرف'),
            ('متصرف  رئيسي','متصرف  رئيسي'),
            ('متصرف محلل','متصرف محلل'),
            ('متصرف مستشار','متصرف مستشار'),
            ('محاسب إداري','محاسب إداري'),
            ('محاسب إداري رئيسي','محاسب إداري رئيسي'),
            ('مساعد متصرف','مساعد متصرف'),
            ('مساعد مهندس م2  في الإحصائيات','مساعد مهندس م2  في الإحصائيات'),
            ('ملحق  رئيسي للإدارة','ملحق  رئيسي للإدارة'),
            ('ملحق الإدارة','ملحق الإدارة'),
            ('تقني في الإعلام الآلي','تقني في الإعلام الآلي'),
            ('تقني سامي في الإعلام الآلي','تقني سامي في الإعلام الآلي'),
            ('رئيس المهندسين في الإعلام الآلي','رئيس المهندسين في الإعلام الآلي'),
            ('مساعد مهندس م1 في الإعلام الآلي','مساعد مهندس م1 في الإعلام الآلي'),
            ('مساعد مهندس م2 في الإعلام الآلي','مساعد مهندس م2 في الإعلام الآلي'),
            ('مهندس دولة في الإعلام الآلي','مهندس دولة في الإعلام الآلي'),
            ('مهندس رئيسي في الإعلام الآلي','مهندس رئيسي في الإعلام الآلي'),
            ('منشط جامعي مستوى 1','منشط جامعي مستوى 1'),
            ('منشط جامعي مستوى 2','منشط جامعي مستوى 2'),
            ('منشط جامعي رئيسي','منشط جامعي رئيسي'),
            ('حارس جامعي رئيسي','حارس جامعي رئيسي'),
            ('تقني سامي للمخابر الجامعية','تقني سامي للمخابر الجامعية'),
            ('رئيس المهندسين في المخابر  الجامعية','رئيس المهندسين في المخابر  الجامعية'),
            ('رئيس المهندسين للمخبر والصيانة','رئيس المهندسين للمخبر والصيانة'),
            ('مساعد مهندس م1 للمخبر و الصيانة','مساعد مهندس م1 للمخبر و الصيانة'),
            ('مساعد مهندس م2 للمخبر والصيانة','مساعد مهندس م2 للمخبر والصيانة'),
            ('ملحق للمخابرالجامعية','ملحق للمخابرالجامعية'),
            ('مهندس دولة  للمخابر الجامعية','مهندس دولة  للمخابر الجامعية'),
            ('مهندس رئيسي للمخابر الجامعية','مهندس رئيسي للمخابر الجامعية'),
            ('رئيس محافظي المكتبات الجامعية','رئيس محافظي المكتبات الجامعية'),
            ('عون تقني للمكتبات الجامعية','عون تقني للمكتبات الجامعية'),
            ('محافظ المكتبات الجامعية','محافظ المكتبات الجامعية'),
            ('مساعد المكتبات الجامعية','مساعد المكتبات الجامعية'),
            ('ملحق بالمكتبات الجامعية من م 1','ملحق بالمكتبات الجامعية من م 1'),
            ('ملحق بالمكتبات الجامعية من م 2','ملحق بالمكتبات الجامعية من م 2'),
            ('مساعد وثائقي امين محفوظات رئيسي','مساعد وثائقي امين محفوظات رئيسي'),
            ('رئيس الوثائقيين أمناء المحفوظات','رئيس الوثائقيين أمناء المحفوظات'),
            ('مساعد وثائقي أمين محفوظات','مساعد وثائقي أمين محفوظات'),
            ('وثائقي أمين محفوظات','وثائقي أمين محفوظات'),
            ('وثائقي أمين محفوظات رئيسي','وثائقي أمين محفوظات رئيسي'),
    )       
           
    Nom = models.CharField(max_length=200)
    Prénom = models.CharField(max_length=200)
    Type = models.CharField(max_length=50) 	
    NIN = models.CharField(max_length=20, unique=True)
    matricule = models.CharField(max_length=12, unique=True, null=True)
    dat_naiss = models.DateField(null=True)	
    Lieu_naiss = models.CharField(max_length=100)
    date_recrut =	models.DateField(null=True)
    grade = models.CharField(max_length=200, choices=GRAD)
    Echelon = models.CharField(max_length=20)
    date_grade = models.DateField(null=True, blank=True)
    Catégorie =	models.CharField(max_length=15)
    division = models.CharField(max_length=200)
    position = 	models.CharField(max_length=30, choices=POSITION, default="في الخدمة")
    faculte = models.CharField(max_length=200, choices=FAC)
    debut_position = models.DateField(null=True, blank=True) 
    fin_position = models.DateField(null=True, blank=True) 
    
    def __str__(self):    
        return f"{self.Nom} {self.Prénom}" 

import os
#----function to generate dynamic path to upload_to
def upload_to(instance, filename):
    # Generate dynamic file upload path based on the grade.
    grad = instance.grade  # Assuming 'grade' is a field in the model
    return os.path.join(f'employe/{grad}/', filename) 

class PDF_employe(models.Model):
    
    pdf_file = models.FileField(upload_to=upload_to,  verbose_name="الملفات")
    uploaded_at = models.DateTimeField(auto_now_add=True)
    user = models.ForeignKey(User, related_name='user_empl_pdfs', on_delete=models.CASCADE)
    n_ident = models.ForeignKey(Employe, related_name='employe_pdfs', on_delete=models.CASCADE)
    grade = models.CharField(max_length=100, default='')
    def __str__(self):
        return f"{self.n_ident.Nom} {self.user}"   

