const POSITIONS = {
  /*[
  { label: "وضع تحت التصرف جمعوي", years: 2 },
  { label: "وضع تحت التصرف بيداغوجي", years: 1 },
  { label: "إستيداع قانوني", years: 5 },
  { label: "إستيداع شخصي", years: 2 },
  { label: "عطلة مرضية طويلة المدة", years: 3 },
  { label: "إنتداب محدد", years: 4 },
  { label: "إنتداب غ محدد", years: 5 },
];*/
  ENS: [
    "في الخدمة",
    "وضع تحت التصرف جمعوي",
    "وضع تحت التصرف بيداغوجي",
    "عطلة مرضية طويلة المدة",
    "إنتداب محدد",
    "إنتداب غ محدد",
    "إستيداع شخصي",
    "إستيداع قانوني",
  ],
  EMP: [
    "في الخدمة",
    "وضع تحت التصرف",
    "عطلة مرضية طويلة المدة",
    "إنتداب محدد",
    "إنتداب غ محدد",
    "إستيداع شخصي",
    "إستيداع قانوني",
  ],
  CONTRAT: [
    "في الخدمة",
    "عطلة مرضية طويلة المدة",
    "عطلة غ مدفوعة الأجر",
    "إنتداب",
  ],
};
export default POSITIONS;
